# Задача 1: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

print("Введите трехзначное число: ")
num = int(input())

if num > 999 or num < 100:
    print("Ошибка ввода.")
else:
    sum = 0
    while num > 0:
        sum += num % 10
        num //= 10
    print("Сумма цифр: ", sum)